#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_route53_zone.zone: Reading...
aws_s3_bucket.juliacodes: Refreshing state... [id=juliacodes.com]
data.aws_route53_zone.zone: Read complete after 1s [id=Z03897451YL9PJPGR1JOW]
aws_s3_bucket_versioning.juliacodes: Refreshing state... [id=juliacodes.com]
data.aws_iam_policy_document.allow_public_access: Reading...
aws_s3_bucket_acl.juliacodes: Refreshing state... [id=juliacodes.com,public-read]
aws_s3_bucket_website_configuration.juliacodes: Refreshing state... [id=juliacodes.com]
data.aws_iam_policy_document.allow_public_access: Read complete after 0s [id=448280006]
aws_s3_bucket_policy.juliacodes: Refreshing state... [id=juliacodes.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.distribution will be created
  + resource "aws_cloudfront_distribution" "distribution" {
      + aliases                        = [
          + "www.juliacodes.net",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "juliacodes.com.s3-website-us-east-1.amazonaws.com"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "juliacodes.com.s3-website-us-east-1.amazonaws.com"
          + origin_id           = "juliacodes.com.s3-website-us-east-1.amazonaws.com"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:622870367449:certificate/afcbb9d4-ad85-46d6-823f-cffab0134318"
          + minimum_protocol_version = "TLSv1.2_2018"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.A will be created
  + resource "aws_route53_record" "A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.juliacodes.net"
      + type            = "A"
      + zone_id         = "Z03897451YL9PJPGR1JOW"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on cloudfront.tf line 3, in resource "aws_cloudfront_distribution" "distribution":
   3:     domain_name = aws_s3_bucket.juliacodes.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jbiers, Action: `pull_request`*